In [2]:

import pandas as pd
india_weather = pd.DataFrame({
    'city':['delhi','pune','chandhighar'],
    'temperature':[40,45,39],
    'humidity':[80,60,70]
})
india_weather

          city  temperature  humidity
0        delhi           40        80
1         pune           45        60
2  chandhighar           39        70

In [3]:

us_weather = pd.DataFrame({
    'city':['new york','los angeles','chicago'],
    'temperature':[32,45,39],
    'humidity':[65,80,40]
})

us_weather

          city  temperature  humidity
0     new york           32        65
1  los angeles           45        80
2      chicago           39        40

In [5]:
# df = pd.concat([us_weather, india_weather], keys=['use','india'])
df = pd.concat([us_weather, india_weather], ignore_index=True)
df

          city  temperature  humidity
0     new york           32        65
1  los angeles           45        80
2      chicago           39        40
3        delhi           40        80
4         pune           45        60
5  chandhighar           39        70